# Bar Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..Bar Property
SymbolTypeId Class See Also
---
Symbol bar, indicating unit Bars.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId Bar { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Bar As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Bar {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace